results-shopcart-native/run_1_2026-01-05_01-12-04/FIXED-800-latency-1-dump.txt
Running 30s test @ http://127.0.0.1:8001
  16 threads and 16 connections
  Thread calibration: mean lat.: 0.878ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.878ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.871ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.872ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.829ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.844ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.839ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.806ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.837ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.827ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.824ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.833ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.810ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.838ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.808ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.826ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.95ms  302.93us   2.13ms   60.44%
    Req/Sec    52.00     51.68   111.00     85.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.95ms
 75.000%    1.20ms
 90.000%    1.35ms
 99.000%    1.51ms
 99.900%    1.72ms
 99.990%    2.02ms
 99.999%    2.13ms
100.000%    2.13ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.167     0.000000            1         1.00
       0.551     0.100000         1605         1.11
       0.646     0.200000         3200         1.25
       0.737     0.300000         4807         1.43
       0.845     0.400000         6402         1.67
       0.950     0.500000         7999         2.00
       1.004     0.550000         8797         2.22
       1.056     0.600000         9592         2.50
       1.109     0.650000        10398         2.86
       1.157     0.700000        11196         3.33
       1.202     0.750000        12000         4.00
       1.226     0.775000        12391         4.44
       1.251     0.800000        12803         5.00
       1.272     0.825000        13197         5.71
       1.297     0.850000        13590         6.67
       1.324     0.875000        13990         8.00
       1.337     0.887500        14190         8.89
       1.349     0.900000        14399        10.00
       1.363     0.912500        14586        11.43
       1.379     0.925000        14790        13.33
       1.394     0.937500        14992        16.00
       1.402     0.943750        15094        17.78
       1.410     0.950000        15190        20.00
       1.419     0.956250        15289        22.86
       1.428     0.962500        15386        26.67
       1.440     0.968750        15493        32.00
       1.446     0.971875        15536        35.56
       1.454     0.975000        15591        40.00
       1.461     0.978125        15636        45.71
       1.469     0.981250        15687        53.33
       1.481     0.984375        15739        64.00
       1.486     0.985938        15760        71.11
       1.495     0.987500        15785        80.00
       1.502     0.989062        15811        91.43
       1.508     0.990625        15836       106.67
       1.523     0.992188        15860       128.00
       1.529     0.992969        15873       142.22
       1.541     0.993750        15885       160.00
       1.548     0.994531        15898       182.86
       1.563     0.995313        15910       213.33
       1.572     0.996094        15923       256.00
       1.583     0.996484        15928       284.44
       1.604     0.996875        15935       320.00
       1.609     0.997266        15941       365.71
       1.624     0.997656        15947       426.67
       1.651     0.998047        15953       512.00
       1.675     0.998242        15956       568.89
       1.686     0.998437        15960       640.00
       1.694     0.998633        15963       731.43
       1.708     0.998828        15966       853.33
       1.739     0.999023        15969      1024.00
       1.750     0.999121        15970      1137.78
       1.757     0.999219        15972      1280.00
       1.781     0.999316        15974      1462.86
       1.788     0.999414        15975      1706.67
       1.794     0.999512        15977      2048.00
       1.794     0.999561        15977      2275.56
       1.820     0.999609        15978      2560.00
       1.854     0.999658        15979      2925.71
       1.918     0.999707        15980      3413.33
       1.925     0.999756        15981      4096.00
       1.925     0.999780        15981      4551.11
       1.925     0.999805        15981      5120.00
       2.019     0.999829        15982      5851.43
       2.019     0.999854        15982      6826.67
       2.103     0.999878        15983      8192.00
       2.103     0.999890        15983      9102.22
       2.103     0.999902        15983     10240.00
       2.103     0.999915        15983     11702.86
       2.103     0.999927        15983     13653.33
       2.135     0.999939        15984     16384.00
       2.135     1.000000        15984          inf
#[Mean    =        0.948, StdDeviation   =        0.303]
#[Max     =        2.134, Total count    =        15984]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  24016 requests in 30.00s, 7.17MB read
Requests/sec:    800.49
Transfer/sec:    244.86KB